Re7e5/kepsilon/0g/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform  1.5;
    }
    outlet
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }
    top
    {
        type             fixedValue;
        value           uniform  1.5;
    }
    bottom
    {
        type            fixedValue;
        value           uniform  1.5;
    }
    front
    {
        type            empty;
    }
   back
   {
        type            empty;
    }
}


// ************************************************************************* //
