Re7e5/kepsilon/0g/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    back
    {
        type            empty;
        inGroups 1(empty);
        nFaces          124707;
        startFace       185354;
    }
    front
    {
         type            empty;
        inGroups 1(empty);
        nFaces          124707;
        startFace       310061;
    }
    airfoil
    {
          type            wall;
        inGroups 1(wall);
        nFaces          3168;
        startFace       434768;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          63;
        startFace       437936;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          79;
        startFace       437999;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          24;
        startFace       438078;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          79;
        startFace       438102;
    }
)

// ************************************************************************* //
